Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_of_documents_needed_when_applying_for_a_student_grant.html.txt.tmx
Source language: en
Languages: ga

source: Checklist of documents needed when applying for a student grant
ga: Seicliosta na gcáipéisí a bhfuil gá leo nuair atáthar ag déanamh iarratais ar dheontas mic léinn

source: When your make your online application for a student grant, SUSI will make a provisional assessment
ga: Nuair a dhéanann tú d’iarratas ar líne ar dheontas mac léinn, déanfaidh SUSI measúnú sealadach

source: You will either get a provisional grant approval or be told that you are not eligible
ga: Gheobhaidh tú ceadú sealadach deontais nó inseofar duit nach bhfuil tú incháilithe

source: Along with the provisional approval you will get a personalised list of documents that you need to provide in support of your application
ga: Mar aon leis an gceadú sealadach, gheobhaidh tú liosta pearsanta cáipéisí a mbeidh ort iad a chur ar fáil mar thaca le d’iarratas

source: It is advisable to start assembling these documents early, as there can be delays in obtaining some of them
ga: Tá sé inmholta tús a chur leis na cáipéisí sin a chur le chéile go luath, mar gur féidir go mbeidh moilleanna ar roinnt díobh a fháil

source: You should submit photocopied documents only but keep the originals safe as you may be asked to produce them later
ga: Ba cheart duit cáipéisí fótachóipeáilte amháin a chur isteach ach coinnigh na bunchóipeanna sábháilte mar gur féidir go n-iarrfar ort iad a thaispeáint ar ball

source: The Department of Education and Skills encourages students to apply for grants as soon as possible so that applications can be processed in good time
ga: Tugann an Roinn Oideachais agus Scileanna spreagadh do mhic léinn iarratas a dhéanamh ar dheontais a luaithe is féidir le gur féidir iarratais a phróiseáil i dtráthúlacht

source: If your family income* is below certain income limits (depending on the size of the family) you may be eligible for a grant
ga: D'fhéadfá le hioncam teaghlaigh* faoi bhun teorainneacha ioncaim áirithe (ag brath ar mhéid do theaghlaigh) a bheith i dteideal deontas cothabhála

source: You must give details of the family income when applying online
ga: Ní mór duitse sonraí faoi ioncam an teaghlaigh a thabhairt nuair déanann tú iarratas ar líne

source: The documents you will be asked for later are proof of the family income and they generally relate to the previous year
ga: Is iad na cáipéisí ar gá iad a sholáthar níos moille ná fianaise faoi ioncam an teaghlaigh, agus de ghnáth baineann siad leis an mbliain roimhe sin

source: For example, if you are applying for a student grant for the year 2017-2018 you will need a P60 and/or statement of social welfare income for the year 2016
ga: Mar shampla, má tá tú ag déanamh iarratais ar dheontas cothabhála don bhliain 2017-2018 iarrfar ort P60 nó ráiteas ioncaim leasa shóisialaigh a sholáthar don bhliain 2016

source: *If you are an independent mature candidate living separately from your parents on 1 October of the year before your application, you are assessed on your own income
ga: *Más iarrthóir neamhspleách aibí thú atá i do chónaí ar leithligh ó do thuismitheoirí ar 1 Deireadh Fómhair an bhliain roimh an iarratas, déantar measúnú ort i gcomhair d'ioncam féin amháin

source: You will need evidence of where you lived from 1 October of the year before your application
ga: Ní gá duit cruthúnas cónaitheachta don 1 Deireadh Fómhair na bliana roimh d’iarratas

source: Student Universal Support Ireland (SUSI) handles all new applications since 2012-13 on and will post out personal document lists along with provisional grant approvals
ga: Pléann Tacaíocht Uilíoch do Mhic Léinn Éire (SUSI) le gach iarratas nua ó 2012-13 agus postálfaidh sí amach liostaí sealadacha cáipéisí i dteannta ceaduithe sealadacha deontais

source: (Renewals of existing grants will be handled by the authority that issued them initially.)
ga: (Is é an t-údarás a d’eisigh iad ar dtús a phléifidh le hathnuachaintí deontas atá ann cheana.)

source: The table below lists the main documents required
ga: Liostaítear na príomhcháipéisí atá ag teastáil sa tábla thíos

source: Depending on your own circumstances, you may need extra documents - these will be listed when you get your provisional approval
ga: Ag brath ar d’imthosca féin, is féidir go mbeidh cáipéisí breise ag teastáil uait - liostófar iad nuair a fhaigheann tú do cheadú sealadach

source: Do not send any documentation unless requested to do so by SUSI
ga: Ná seol aon cháipéisí mura n-iarrann SUSI ort déanamh amhlaidh

source: │Section │Main documents required (see guidance notes for more) │
ga: │Cuid │Príomhcáipéisí éilithe (féach treoirnótaí chun tuilleadh a fháil) │

source: │ │Long form of birth certificate (if born in Ireland) │
ga: │ │Foirm fhada den teastas breithe (má saolaíodh in Éirinn tú) │

source: │ │If not born in Ireland, a certified copy of your passport, your national │ │Personal │identity card or similar document │
ga: │ │Murar saolaíodh in Éirinn tú, cóip dheimhnithe de do phas, do chárta aitheantais náisiúnta nó doiciméad comhchosúil │

source: │nationality and │Evidence that you were legally resident in Ireland for 3 of the 5 years │ │place of residence │before the course starts (see guidance notes for more detail) │
ga: │ │Fianaise go bhfuil tú i do chónaí go dlíthiúil in Éirinn ar a laghad 3 bliana as na 5 cinn roimh thús do chúrsa (féach treoirnótaí chun tuilleadh a fháil) │

source: │ │Independent mature candidates require proof of living apart from their │ │ │parents on 1 October of the previous year, such as a utility bill, │
ga: │ │Ní mór d'iarrthóirí neamhspleácha aibí cruthúnas cónaitheachta, cosúil le bille fóntais, clárú leis an BTCP nó litir ó roinn rialtas, a sholáthar don 1 Deireadh Fómhair na bliana roimhe sin │

source: │ │registration with the PRTB or a letter from a Government department
ga: │ │P21 ráiteas comhardaithe ÍMAT │

source: │ │P21 PAYE balancing statement │
ga: │ │P60 do gach fostaíocht │

source: │Income from │P60 for each employment │
ga: │Ioncam ó fhostaíocht nó ó phinsean nach pinsean leasa shóisialaigh é │P45, más infheidhme │

source: │non-social welfare │If applicable, P45 │
ga: │ │Litir ó fhostóir nó ó riarthóir na scéime pinsin │

source: │ │Payslips for employment outside term time in 2016 │
ga: │ │Duillín pá le haghaidh fostaíochta i rith laethanta saoire i 2016 │

source: │Income from │Copy of accounts for each business │
ga: │ │Cóip de na cuntais do gach gnó │

source: │self-employment │Computation of profit/(loss) for income tax │
ga: │Ioncam ó fhéinfhostaíocht lena n-áirítear feirmeoireacht │Ríomh de bhrabús/(caillteanas) do cháin ioncaim │

source: │including farming │Notice of assessment │
ga: │ │Fógra faoi mheasúnú │

source: │ │Copy of receipt from a PRSA or Retirement Annuity provider │
ga: │ │Cóip d'admháil ó CPCS nó soláthraí Blianachta Scoir │

source: │Rent and other │Copy of accounts for each business │
ga: │ │Cóip de na cuntais do gach gnó │

source: │income from land and│Computation of profit/(loss) for income tax │
ga: │Cíos agus ioncam eile ó thalamh agus maoin │Ríomh de bhrabús/(caillteanas) do cháin ioncaim │

source: │property │Notice of assessment │
ga: │ │Fógra faoi mheasúnú │

source: │ │Maintenance agreement, stating amount received each month │
ga: │ │Comhaontú cothabhála a leagann síos an méid fágtha gach mí │

source: │maintenance, │P21 PAYE Balancing Statement or Notice of Assessment for 2016 │
ga: │Ioncam ó airgead cothabhála, comhaontuithe scartha/colscartha │P21 ráiteas comhardaithe IMAT nó Fógra Measúnaithe do 2016 │

source: │agreements │Evidence of maintenance payments and any bills etc
ga: │ │Fianaise íocaíochtaí cothabhála agus aon bhille srl
